; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v2 - type_1 ?v1 - type_2)
 	      (pred_2 ?v7 - object ?v1 - type_2)
	      (pred_3 ?v2 - type_1 ?v8 - type_3)
	      (pred_1 ?v2 - type_1 ?v7 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v2 - type_1 ?v4 ?v3 - type_2)
       :precondition (and  (pred_4 ?v2 ?v4))
       :effect (and  (pred_4 ?v2 ?v3)
		     (not (pred_4 ?v2 ?v4))))

   (:action op_2
       :parameters (?v2 - type_1 ?v6 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v5) (pred_4 ?v2 ?v5) (pred_3 ?v2 ?v8))
       :effect (and (pred_1 ?v2 ?v6 ?v8)
		    (not (pred_2 ?v6 ?v5)) 
		    (not (pred_3 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_1 ?v6 - object ?v5 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v6 ?v8) (pred_4 ?v2 ?v5))
       :effect (and (pred_2 ?v6 ?v5)
		    (pred_3 ?v2 ?v8)
		    (not (pred_1 ?v2 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_10 - type_1
obj_03 obj_05 obj_11 obj_14 - type_3
obj_09 obj_02 obj_13 obj_07 - type_2
obj_06 obj_08 obj_01 obj_12 - object)
(:init
(pred_4 obj_04 obj_07)
(pred_3 obj_04 obj_03)
(pred_3 obj_04 obj_05)
(pred_4 obj_10 obj_02)
(pred_3 obj_10 obj_11)
(pred_3 obj_10 obj_14)
(pred_2 obj_06 obj_02)
(pred_2 obj_08 obj_07)
(pred_2 obj_01 obj_13)
(pred_2 obj_12 obj_09)
)
(:goal
(and
(pred_2 obj_06 obj_02)
(pred_2 obj_08 obj_13)
(pred_2 obj_01 obj_07)
(pred_2 obj_12 obj_02)
)
)

(:constraints
  (always (not (pred_4 obj_04 obj_13)))
)
)

; plan
1. (op_2 obj_04 obj_08 obj_07 obj_05)
   deleted: (pred_2 obj_08 obj_07) (pred_3 obj_04 obj_05)
   added: (pred_1 obj_04 obj_08 obj_05)
   goals met: 1 of 4
2. (op_1 obj_10 obj_02 obj_09)
   deleted: (pred_4 obj_10 obj_02)
   added: (pred_4 obj_10 obj_09)
   goals met: 1 of 4
3. (op_2 obj_10 obj_12 obj_09 obj_14)
   deleted: (pred_2 obj_12 obj_09) (pred_3 obj_10 obj_14)
   added: (pred_1 obj_10 obj_12 obj_14)
   goals met: 1 of 4
4. (op_1 obj_10 obj_09 obj_02)
   deleted: (pred_4 obj_10 obj_09)
   added: (pred_4 obj_10 obj_02)
   goals met: 1 of 4
5. (op_3 obj_10 obj_12 obj_02 obj_14)
   deleted: (pred_1 obj_10 obj_12 obj_14)
   added: (pred_2 obj_12 obj_02) (pred_3 obj_10 obj_14)
   goals met: 2 of 4
6. (op_1 obj_10 obj_02 obj_13)
   deleted: (pred_4 obj_10 obj_02)
   added: (pred_4 obj_10 obj_13)
   goals met: 2 of 4
7. (op_2 obj_10 obj_01 obj_13 obj_14)
   deleted: (pred_2 obj_01 obj_13) (pred_3 obj_10 obj_14)
   added: (pred_1 obj_10 obj_01 obj_14)
   goals met: 2 of 4
8. (op_1 obj_10 obj_13 obj_07)
   deleted: (pred_4 obj_10 obj_13)
   added: (pred_4 obj_10 obj_07)
   goals met: 2 of 4
9. (op_3 obj_10 obj_01 obj_07 obj_14)
   deleted: (pred_1 obj_10 obj_01 obj_14)
   added: (pred_2 obj_01 obj_07) (pred_3 obj_10 obj_14)
   goals met: 3 of 4
10. (op_3 obj_04 obj_08 obj_07 obj_05)
   deleted: (pred_1 obj_04 obj_08 obj_05)
   added: (pred_2 obj_08 obj_07) (pred_3 obj_04 obj_05)
   goals met: 3 of 4
11. (op_2 obj_10 obj_08 obj_07 obj_14)
   deleted: (pred_2 obj_08 obj_07) (pred_3 obj_10 obj_14)
   added: (pred_1 obj_10 obj_08 obj_14)
   goals met: 3 of 4
12. (op_1 obj_10 obj_07 obj_13)
   deleted: (pred_4 obj_10 obj_07)
   added: (pred_4 obj_10 obj_13)
   goals met: 3 of 4
13. (op_3 obj_10 obj_08 obj_13 obj_14)
   deleted: (pred_1 obj_10 obj_08 obj_14)
   added: (pred_2 obj_08 obj_13) (pred_3 obj_10 obj_14)
   goals met: 4 of 4
